QUESTION 1:

In [1]:
import pandas as pd
l=[4, 8, 15, 16, 23, 42]
df=pd.Series(l)
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

QUESTION 2:

In [2]:
import pandas as pd
l=[4, 8, 15, 16, 23, 42,23.89,12,900,"XYZ",True,100]
df=pd.Series(l)
df

0         4
1         8
2        15
3        16
4        23
5        42
6     23.89
7        12
8       900
9       XYZ
10     True
11      100
dtype: object

QUESTION 3:

In [3]:
import pandas as pd
data={
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}

df=pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

QUESTION 4:

Pandas DataFrame is a 2 dimensional data structure which is similar to tables with rows and columns.
Pandas series is like a column in a table.

In [4]:
import pandas as pd
l=[4, 8, 15, 16, 23, 42]
df=pd.Series(l)
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
import pandas as pd
data={
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}

df=pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

QUESTION 5:

Some common functions that can be used to manipulate data in a Pandas DataFrame are head, tail,columns etc

QUESTION 6:

Dataframe and Panel is mutable where as Series are immutable.

QUESTION 7:

In [6]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data)
df

   calories  duration
0       420        50
1       380        40
2       390        45